const fields = [{
"field1": "1",
"field2": "سورة الفاتحة",
"field3": "7",
"field4": "مكية"
}, {
"field1": "2",
"field2": "سورة البقرة",
"field3": "286",
"field4": "مدنية"
}, {
"field1": "3",
"field2": "سورة آل عمران",
"field3": "200",
"field4": "مدنية"
}, {
"field1": "4",
"field2": "سورة النساء",
"field3": "176",
"field4": "مدنية"
}, {
"field1": "5",
"field2": "سورة المائدة",
"field3": "120",
"field4": "مدنية"
}, {
"field1": "6",
"field2": "سورة الأنعام",
"field3": "165",
"field4": "مكية"
}, {
"field1": "7",
"field2": "سورة الأعراف",
"field3": "206",
"field4": "مكية"
}, {
"field1": "8",
"field2": "سورة الأنفال",
"field3": "75",
"field4": "مدنية"
}, {
"field1": "9",
"field2": "سورة التوبة",
"field3": "129",
"field4": "مدنية"
}, {
"field1": "10",
"field2": "سورة يونس",
"field3": "109",
"field4": "مكية"
}, {
"field1": "11",
"field2": "سورة هود",
"field3": "123",
"field4": "مكية"
}, {
"field1": "12",
"field2": "سورة يوسف",
"field3": "111",
"field4": "مكية"
}, {
"field1": "13",
"field2": "سورة الرعد",
"field3": "43",
"field4": "مدنية"
}, {
"field1": "14",
"field2": "سورة إبراهيم",
"field3": "52",
"field4": "مكية"
}, {
"field1": "15",
"field2": "سورة الحجر",
"field3": "99",
"field4": "مكية"
}, {
"field1": "16",
"field2": "سورة النحل",
"field3": "128",
"field4": "مكية"
}, {
"field1": "17",
"field2": "سورة الإسراء",
"field3": "111",
"field4": "مكية"
}, {
"field1": "18",
"field2": "سورة الكهف",
"field3": "110",
"field4": "مكية"
}, {
"field1": "19",
"field2": "سورة مريم",
"field3": "98",
"field4": "مكية"
}, {
"field1": "20",
"field2": "سورة طه",
"field3": "135",
"field4": "مكية"
}, {
"field1": "21",
"field2": "سورة الأنبياء",
"field3": "112",
"field4": "مكية"
}, {
"field1": "22",
"field2": "سورة الحج",
"field3": "78",
"field4": "مدنية"
}, {
"field1": "23",
"field2": "سورة المؤمنون",
"field3": "118",
"field4": "مكية"
}, {
"field1": "24",
"field2": "سورة النور",
"field3": "64",
"field4": "مدنية"
}, {
"field1": "25",
"field2": "سورة الفرقان",
"field3": "77",
"field4": "مكية"
}, {
"field1": "26",
"field2": "سورة الشعراء",
"field3": "227",
"field4": "مكية"
}, {
"field1": "27",
"field2": "سورة النمل",
"field3": "93",
"field4": "مكية"
}, {
"field1": "28",
"field2": "سورة القصص",
"field3": "88",
"field4": "مكية"
}, {
"field1": "29",
"field2": "سورة العنكبوت",
"field3": "69",
"field4": "مكية"
}, {
"field1": "30",
"field2": "سورة الروم",
"field3": "60",
"field4": "مكية"
}, {
"field1": "31",
"field2": "سورة لقمان",
"field3": "34",
"field4": "مكية"
}, {
"field1": "32",
"field2": "سورة السجدة",
"field3": "30",
"field4": "مكية"
}, {
"field1": "33",
"field2": "سورة الأحزاب",
"field3": "73",
"field4": "مدنية"
}, {
"field1": "34",
"field2": "سورة سبأ",
"field3": "54",
"field4": "مكية"
}, {
"field1": "35",
"field2": "سورة فاطر",
"field3": "45",
"field4": "مكية"
}, {
"field1": "36",
"field2": "سورة يس",
"field3": "83",
"field4": "مكية"
}, {
"field1": "37",
"field2": "سورة الصافات",
"field3": "182",
"field4": "مكية"
}, {
"field1": "38",
"field2": "سورة ص",
"field3": "88",
"field4": "مكية"
}, {
"field1": "39",
"field2": "سورة الزمر",
"field3": "75",
"field4": "مكية"
}, {
"field1": "40",
"field2": "سورة غافر",
"field3": "85",
"field4": "مكية"
}, {
"field1": "41",
"field2": "سورة فصلت",
"field3": "54",
"field4": "مكية"
}, {
"field1": "42",
"field2": "سورة الشورى",
"field3": "53",
"field4": "مكية"
}, {
"field1": "43",
"field2": "سورة الزخرف",
"field3": "89",
"field4": "مكية"
}, {
"field1": "44",
"field2": "سورة الدخان",
"field3": "59",
"field4": "مكية"
}, {
"field1": "45",
"field2": "سورة الجاثية",
"field3": "37",
"field4": "مكية"
}, {
"field1": "46",
"field2": "سورة الأحقاف",
"field3": "35",
"field4": "مكية"
}, {
"field1": "47",
"field2": "سورة محمد",
"field3": "38",
"field4": "مدنية"
}, {
"field1": "48",
"field2": "سورة الفتح",
"field3": "29",
"field4": "مدنية"
}, {
"field1": "49",
"field2": "سورة الحجرات",
"field3": "18",
"field4": "مدنية"
}, {
"field1": "50",
"field2": "سورة ق",
"field3": "45",
"field4": "مكية"
}, {
"field1": "51",
"field2": "سورة الذاريات",
"field3": "60",
"field4": "مكية"
}, {
"field1": "52",
"field2": "سورة الطور",
"field3": "49",
"field4": "مكية"
}, {
"field1": "53",
"field2": "سورة النجم",
"field3": "62",
"field4": "مكية"
}, {
"field1": "54",
"field2": "سورة القمر",
"field3": "55",
"field4": "مكية"
}, {
"field1": "55",
"field2": "سورة الرحمن",
"field3": "78",
"field4": "مدنية"
}, {
"field1": "56",
"field2": "سورة الواقعة",
"field3": "96",
"field4": "مكية"
}, {
"field1": "57",
"field2": "سورة الحديد",
"field3": "29",
"field4": "مدنية"
}, {
"field1": "58",
"field2": "سورة المجادلة",
"field3": "22",
"field4": "مدنية"
}, {
"field1": "59",
"field2": "سورة الحشر",
"field3": "24",
"field4": "مدنية"
}, {
"field1": "60",
"field2": "سورة الممتحنة",
"field3": "13",
"field4": "مدنية"
}, {
"field1": "61",
"field2": "سورة الصف",
"field3": "14",
"field4": "مدنية"
}, {
"field1": "62",
"field2": "سورة الجمعة",
"field3": "11",
"field4": "مدنية"
}, {
"field1": "63",
"field2": "سورة المنافقون",
"field3": "11",
"field4": "مدنية"
}, {
"field1": "64",
"field2": "سورة التغابن",
"field3": "18",
"field4": "مدنية"
}, {
"field1": "65",
"field2": "سورة الطلاق",
"field3": "12",
"field4": "مدنية"
}, {
"field1": "66",
"field2": "سورة التحريم",
"field3": "12",
"field4": "مدنية"
}, {
"field1": "67",
"field2": "سورة الملك",
"field3": "30",
"field4": "مكية"
}, {
"field1": "68",
"field2": "سورة القلم",
"field3": "52",
"field4": "مكية"
}, {
"field1": "69",
"field2": "سورة الحاقة",
"field3": "52",
"field4": "مكية"
}, {
"field1": "70",
"field2": "سورة المعارج",
"field3": "44",
"field4": "مكية"
}, {
"field1": "71",
"field2": "سورة نوح",
"field3": "28",
"field4": "مكية"
}, {
"field1": "72",
"field2": "سورة الجن",
"field3": "28",
"field4": "مكية"
}, {
"field1": "73",
"field2": "سورة المزمل",
"field3": "20",
"field4": "مكية"
}, {
"field1": "74",
"field2": "سورة المدثر",
"field3": "56",
"field4": "مكية"
}, {
"field1": "75",
"field2": "سورة القيامة",
"field3": "40",
"field4": "مكية"
}, {
"field1": "76",
"field2": "سورة الإنسان",
"field3": "31",
"field4": "مدنية"
}, {
"field1": "77",
"field2": "سورة المرسلات",
"field3": "50",
"field4": "مكية"
}, {
"field1": "78",
"field2": "سورة النبأ",
"field3": "40",
"field4": "مكية"
}, {
"field1": "79",
"field2": "سورة النازعات",
"field3": "46",
"field4": "مكية"
}, {
"field1": "80",
"field2": "سورة عبس",
"field3": "42",
"field4": "مكية"
}, {
"field1": "81",
"field2": "سورة التكوير",
"field3": "29",
"field4": "مكية"
}, {
"field1": "82",
"field2": "سورة الإنفطار",
"field3": "19",
"field4": "مكية"
}, {
"field1": "83",
"field2": "سورة المطففين",
"field3": "36",
"field4": "مكية"
}, {
"field1": "84",
"field2": "سورة الإنشقاق",
"field3": "25",
"field4": "مكية"
}, {
"field1": "85",
"field2": "سورة البروج",
"field3": "22",
"field4": "مكية"
}, {
"field1": "86",
"field2": "سورة الطارق",
"field3": "17",
"field4": "مكية"
}, {
"field1": "87",
"field2": "سورة الأعلى",
"field3": "19",
"field4": "مكية"
}, {
"field1": "88",
"field2": "سورة الغاشية",
"field3": "26",
"field4": "مكية"
}, {
"field1": "89",
"field2": "سورة الفجر",
"field3": "30",
"field4": "مكية"
}, {
"field1": "90",
"field2": "سورة البلد",
"field3": "20",
"field4": "مكية"
}, {
"field1": "91",
"field2": "سورة الشمس",
"field3": "15",
"field4": "مكية"
}, {
"field1": "92",
"field2": "سورة الليل",
"field3": "21",
"field4": "مكية"
}, {
"field1": "93",
"field2": "سورة الضحي",
"field3": "11",
"field4": "مكية"
}, {
"field1": "94",
"field2": "سورة الشرح",
"field3": "8",
"field4": "مكية"
}, {
"field1": "95",
"field2": "سورة التين",
"field3": "8",
"field4": "مكية"
}, {
"field1": "96",
"field2": "سورة العلق",
"field3": "19",
"field4": "مكية"
}, {
"field1": "97",
"field2": "سورة القدر",
"field3": "5",
"field4": "مكية"
}, {
"field1": "98",
"field2": "سورة البينة",
"field3": "8",
"field4": "مدنية"
}, {
"field1": "99",
"field2": "سورة الزلزلة",
"field3": "8",
"field4": "مدنية"
}, {
"field1": "100",
"field2": "سورة العاديات",
"field3": "11",
"field4": "مكية"
}, {
"field1": "101",
"field2": "سورة القارعة",
"field3": "11",
"field4": "مكية"
}, {
"field1": "102",
"field2": "سورة التكاثر",
"field3": "8",
"field4": "مكية"
}, {
"field1": "103",
"field2": "سورة العصر",
"field3": "3",
"field4": "مكية"
}, {
"field1": "104",
"field2": "سورة الهمزة",
"field3": "9",
"field4": "مكية"
}, {
"field1": "105",
"field2": "سورة الفيل",
"field3": "5",
"field4": "مكية"
}, {
"field1": "106",
"field2": "سورة قريش",
"field3": "4",
"field4": "مكية"
}, {
"field1": "107",
"field2": "سورة الماعون",
"field3": "7",
"field4": "مكية"
}, {
"field1": "108",
"field2": "سورة الكوثر",
"field3": "3",
"field4": "مكية"
}, {
"field1": "109",
"field2": "سورة الكافرون",
"field3": "6",
"field4": "مكية"
}, {
"field1": "110",
"field2": "سورة النصر",
"field3": "3",
"field4": "مدنية"
}, {
"field1": "111",
"field2": "سورة المسد",
"field3": "5",
"field4": "مكية"
}, {
"field1": "112",
"field2": "سورة الإخلاص",
"field3": "4",
"field4": "مكية"
}, {
"field1": "113",
"field2": "سورة الفلق",
"field3": "5",
"field4": "مكية"
}, {
"field1": "114",
"field2": "سورة الناس",
"field3": "6",
"field4": "مكية"
}];
